[
  {
    "version": "2.0",
    "date": "08.07.2025",
    "changes": [
      {
        "type": "new",
        "text": "Полностью новый графический интерфейс (GUI) на базе CustomTkinter с настройками в реальном времени."
      },
      {
        "type": "new",
        "text": "Добавлена система проверки доступа по HWID через Google Таблицы для защиты."
      },
      {
        "type": "new",
        "text": "Внедрена система автоматического обновления программы через GitHub Releases."
      },
      {
        "type": "new",
        "text": "Создана система сохранения настроек. Все данные шифруются и привязываются к компьютеру."
      },
      {
        "type": "new",
        "text": "Добавлена функция создания и обрезки скриншотов для дорогих инвентарей (>150$)."
      },
      {
        "type": "new",
        "text": "Добавлены кастомные всплывающие уведомления, настраиваемые по размеру и позиции."
      },
      {
        "type": "new",
        "text": "Уникальная функция отслеживания добавления в друзья в Steam (активация по хоткею)."
      },
      {
        "type": "update",
        "text": "Кардинально переработана архитектура: UI и мониторинг теперь работают в разных потоках, что исключает зависания."
      },
      {
        "type": "update",
        "text": "Улучшен парсинг инвентарей: теперь используется Playwright для 100% стабильного взаимодействия с сайтом."
      },
      {
        "type": "update",
        "text": "Улучшена интеграция с Telegram: добавлены интерактивные кнопки ('История', 'Остановить')."
      },
      {
        "type": "fix",
        "text": "Решена проблема с блокировкой программы из-за постоянно появляющегося куки-баннера на сайте."
      }
    ]
  },
  {
    "version": "1.0",
    "date": "03.07.2025",
    "changes": [
      {
        "type": "new",
        "text": "Первый публичный релиз. Базовый функционал мониторинга буфера обмена и отправки экранных и телеграм уведомлений"
      }
    ]
  }
]
